#+OPTIONS: num:nil
#+TITLE: QCA Data Map
#+AUTHOR: Gabriel Petrini
#+startup: fold
#+PROPERTY:header-args python :results output drawer :eval never-export :session map :exports both
#+PROPERTY:header-args R:results output drawer :eval never-export :session map :exports both
** Python
#+begin_src python
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from tabulate import tabulate

print("numpy version  : ", np.__version__)
print("pandas version : ", pd.__version__)
print("seaborn version : ", sns.__version__)

plt.style.use('seaborn-white')
#+end_src

#+RESULTS:
:results:
numpy version  :  1.18.4
pandas version :  1.1.3
seaborn version :  0.11.0
:end:
** R

#+begin_src R
library(tidyverse, warn.conflicts = FALSE) # dplyr, ggplot2, etc
library(gghighlight) # for some data in second plane
library(haven) # For loading stata datasets

options(warn = -1)
#+end_src

#+RESULTS:
:results:
:end:

** Quick inspection
#+begin_src python :results pp
df = pd.read_excel(
    io="http://www.macrohistory.net/JST/JSTdatasetR4.xlsx",
    sheet_name="Data",
    index_col=[2, 0],
    parse_dates=True,
)
df = df.drop(["country", "ifs", "peg_type", "peg_base"], axis="columns")
print(df.describe())
#+end_src

#+RESULTS:
#+begin_example
                 pop       rgdpmad       rgdppc       rconpc           gdp  ...    bond_rate   eq_div_rtn   capital_tr     risky_tr      safe_tr
count    2499.000000   2499.000000  2499.000000  2411.000000  2.474000e+03  ...  2301.000000  2083.000000  1763.000000  1786.000000  2168.000000
mean    31955.383336   8682.644589    37.832058    40.043222  2.177163e+06  ...     0.055887     0.043225     0.100468     0.112592     0.052806
std     45230.239000   7551.731010    32.145419    30.860849  1.468816e+07  ...     0.030687     0.017700     0.091458     0.111806     0.048646
min      1675.000000    737.375497     3.263085     4.074400  1.250757e-11  ...    -0.000400     0.000000    -0.232140    -0.238515    -0.152371
25%      5107.933000   2771.511473    12.509331    15.235000  3.262150e+01  ...     0.036950     0.032460     0.049847     0.051196     0.026311
50%     10605.870000   5193.394590    22.125076    26.560000  1.613274e+03  ...     0.046900     0.043091     0.091775     0.103964     0.043828
75%     45613.500000  14024.706784    61.578296    64.933650  4.150800e+04  ...     0.064158     0.053744     0.139122     0.162037     0.069026
max    322783.332739  36359.374592   117.645175   115.435926  1.861064e+08  ...     0.237154     0.138189     1.144161     1.281639     0.408514

[8 rows x 45 columns]
#+end_example

